def знайти_унікальні_літери(слово1, слово2):
    унікальні_літери = []
    for літера in слово1:
        if літера not in слово2 and слово1.count(літера) == 1:
            унікальні_літери.append(літера)
    for літера in слово2:
        if літера not in слово1 and слово2.count(літера) == 1:
            унікальні_літери.append(літера)
    return унікальні_літери

# Задання слів
слово1 = input("Введіть перше слово: ")
слово2 = input("Введіть друге слово: ")

# Знаходимо та виводимо унікальні літери
унікальні_літери = знайти_унікальні_літери(слово1, слово2)
print("Унікальні літери, які зустрічаються тільки один раз у обох словах:", унікальні_літери)
