def знайти_слова_з_о(речення):
    слова = речення.split()  # Розбиваємо речення на слова
    
    слова_з_о = []  # Створюємо список для зберігання слів з літерою "о"
    
    for слово in слова:
        if 'о' in слово.lower():  # Перевіряємо, чи містить слово літеру "о" (регістронезалежно)
            слова_з_о.append(слово)  # Додаємо слово до списку
    
    return слова_з_о

# Задання речення
речення = input("Введіть речення: ")

# Знаходимо та виводимо слова з літерою "о"
слова_з_о = знайти_слова_з_о(речення)
if слова_з_о:
    print("Слова, які містять літеру 'о':")
    for слово in слова_з_о:
        print(слово)
else:
    print("У введеному реченні відсутні слова з літерою 'о'.")
